# LIVE-CLASSES-Module-4 Assignment

In [7]:
-- 1. Use the inbuilt functions and find the minimum, maximum and average amount from the orders table
SELECT
    AVG(AMOUNT) AS AVG_AMOUNT,
    MIN(AMOUNT) AS MIN_AMOUNT,
    MAX(AMOUNT) AS MAX_AMOUNT
FROM ORDERS

AVG_AMOUNT,MIN_AMOUNT,MAX_AMOUNT
778,23,2212

In [8]:
-- 2. Create a user-defined function, which will multiply the given number with 10
CREATE FUNCTION udf_func_mul(@num INT)
RETURNS INT
AS
BEGIN
RETURN (@num*10)
END

: Msg 2714, Level 16, State 3, Procedure udf_func_mul, Line 2
There is already an object named 'udf_func_mul' in the database.

In [9]:
SELECT dbo.udf_func_mul(9) AS MULTIPLY_BY_10

MULTIPLY_BY_10
90

In [10]:
-- 3. Use the case statement to check if 100 is less than 200, greater than 200 or equal to 200 and  print the corresponding value
SELECT
CASE
WHEN 100<200 THEN '100 IS LESS THAN 200'
WHEN 100>200 THEN '100 IS GREATER THAN 200'
ELSE '100 IS EQUAL TO 200'
END

(No column name)
100 IS LESS THAN 200